.. _ni_userguide:

NI Strings
============

Introduction
------------

The function :func:`clean_cu_ni() <dataprep.clean.clean_cu_ni.clean_cu_ni>` cleans a column containing Cuban identity card numbers (NI) strings, and standardizes them in a given format. The function :func:`validate_cu_ni() <dataprep.clean.clean_cu_ni.validate_cu_ni>` validates either a single NI strings, a column of NI strings or a DataFrame of NI strings, returning `True` if the value is valid, and `False` otherwise.

NI strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "91021027775"
* `standard`: NI strings with proper whitespace in the proper places. Note that in the case of NI, the compact format is the same as the standard one.
* `birthdate`: split the date parts from the number and return the birth date, like "1991-02-10".
* `gender`: return the gender (M/F) from the person's NI.

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_cu_ni()` and `validate_cu_ni()`.

### An example dataset containing NI strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "ni": [
            '91021027775',
            '9102102777A',
            '7542011030',
            '7552A10004',
            '8019010008',
            "hello",
            np.nan,
            "NULL",
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "1111 S Figueroa St, Los Angeles, CA 90015",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

            ni                                           address
0  91021027775                                     123 Pine Ave.
1  9102102777A                                           main st
2   7542011030                      1234 west main heights 57033
3   7552A10004                    apt 1 789 s maple rd manhattan
4   8019010008                robie house, 789 north main street
5        hello         1111 S Figueroa St, Los Angeles, CA 90015
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles
7         NULL                                             hello

## 1. Default `clean_cu_ni`

By default, `clean_cu_ni` will clean ni strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_cu_ni
clean_cu_ni(df, column = "ni")

            ni                                           address     ni_clean
0  91021027775                                     123 Pine Ave.  91021027775
1  9102102777A                                           main st          NaN
2   7542011030                      1234 west main heights 57033          NaN
3   7552A10004                    apt 1 789 s maple rd manhattan          NaN
4   8019010008                robie house, 789 north main street          NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015          NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_cu_ni(df, column = "ni", output_format="standard")

            ni                                           address     ni_clean
0  91021027775                                     123 Pine Ave.  91021027775
1  9102102777A                                           main st          NaN
2   7542011030                      1234 west main heights 57033          NaN
3   7552A10004                    apt 1 789 s maple rd manhattan          NaN
4   8019010008                robie house, 789 north main street          NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015          NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

### `compact`

In [4]:
clean_cu_ni(df, column = "ni", output_format="compact")

            ni                                           address     ni_clean
0  91021027775                                     123 Pine Ave.  91021027775
1  9102102777A                                           main st          NaN
2   7542011030                      1234 west main heights 57033          NaN
3   7552A10004                    apt 1 789 s maple rd manhattan          NaN
4   8019010008                robie house, 789 north main street          NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015          NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

### `birthdate`

In [5]:
clean_cu_ni(df, column = "ni", output_format="birthdate")

            ni                                           address    ni_clean
0  91021027775                                     123 Pine Ave.  1991-02-10
1  9102102777A                                           main st         NaN
2   7542011030                      1234 west main heights 57033         NaN
3   7552A10004                    apt 1 789 s maple rd manhattan         NaN
4   8019010008                robie house, 789 north main street         NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015         NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles         NaN
7         NULL                                             hello         NaN

### `gender`

In [6]:
clean_cu_ni(df, column = "ni", output_format="gender")

            ni                                           address ni_clean
0  91021027775                                     123 Pine Ave.        F
1  9102102777A                                           main st      NaN
2   7542011030                      1234 west main heights 57033      NaN
3   7552A10004                    apt 1 789 s maple rd manhattan      NaN
4   8019010008                robie house, 789 north main street      NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015      NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles      NaN
7         NULL                                             hello      NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned NI strings is added with a title in the format `"{original title}_clean"`.

In [7]:
clean_cu_ni(df, column="ni", inplace=True)

      ni_clean                                           address
0  91021027775                                     123 Pine Ave.
1          NaN                                           main st
2          NaN                      1234 west main heights 57033
3          NaN                    apt 1 789 s maple rd manhattan
4          NaN                robie house, 789 north main street
5          NaN         1111 S Figueroa St, Los Angeles, CA 90015
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles
7          NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [8]:
clean_cu_ni(df, "ni", errors="coerce")

            ni                                           address     ni_clean
0  91021027775                                     123 Pine Ave.  91021027775
1  9102102777A                                           main st          NaN
2   7542011030                      1234 west main heights 57033          NaN
3   7552A10004                    apt 1 789 s maple rd manhattan          NaN
4   8019010008                robie house, 789 north main street          NaN
5        hello         1111 S Figueroa St, Los Angeles, CA 90015          NaN
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

### `ignore`

In [9]:
clean_cu_ni(df, "ni", errors="ignore")

            ni                                           address     ni_clean
0  91021027775                                     123 Pine Ave.  91021027775
1  9102102777A                                           main st  9102102777A
2   7542011030                      1234 west main heights 57033   7542011030
3   7552A10004                    apt 1 789 s maple rd manhattan   7552A10004
4   8019010008                robie house, 789 north main street   8019010008
5        hello         1111 S Figueroa St, Los Angeles, CA 90015        hello
6          NaN  (staples center) 1111 S Figueroa St, Los Angeles          NaN
7         NULL                                             hello          NaN

## 4. `validate_cu_ni()`

`validate_cu_ni()` returns `True` when the input is a valid NI. Otherwise it returns `False`.

The input of `validate_cu_ni()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_cu_ni()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_cu_ni()` returns the validation result for the whole DataFrame.

In [10]:
from dataprep.clean import validate_cu_ni
print(validate_cu_ni('91021027775'))
print(validate_cu_ni('9102102777A'))
print(validate_cu_ni('7542011030'))
print(validate_cu_ni('7552A10004'))
print(validate_cu_ni('8019010008'))
print(validate_cu_ni("hello"))
print(validate_cu_ni(np.nan))
print(validate_cu_ni("NULL"))

True
False
False
False
False
False
False
False

### Series

In [11]:
validate_cu_ni(df["ni"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: ni, dtype: bool

### DataFrame + Specify Column

In [12]:
validate_cu_ni(df, column="ni")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: ni, dtype: bool

### Only DataFrame

In [13]:
validate_cu_ni(df)

      ni  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False
7  False    False